docs/state_machines/mmd/en/global/access_state_User.mmd
stateDiagram-v2
  direction LR

  state "active" as active
  state "blocked" as closed

  [*] --> active
  active --> closed : block
  closed --> active : reactivate
